## Production: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 17 to add, 3 to change, 9 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecr will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecr"  {
      ~ id      = "2084780315" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:UploadLayerPart",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda"
                      - Sid      = "AllowPushPull"
                    },
                  - {
                      - Action   = "lambda:UpdateFunctionCode"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda"
                      - Sid      = "PermissionsToUpdateFunction"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # aws_api_gateway_base_path_mapping.api must be replaced
-/+ resource "aws_api_gateway_base_path_mapping" "api" {
      ~ domain_name = "api-lambda.notification.canada.ca" -> "api.notification.canada.ca" # forces replacement
      ~ id          = "api-lambda.notification.canada.ca/" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_base_path_mapping.api_lambda will be created
  + resource "aws_api_gateway_base_path_mapping" "api_lambda" {
      + api_id      = "71oj6jax35"
      + domain_name = "api-lambda.notification.canada.ca"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # aws_api_gateway_domain_name.api must be replaced
-/+ resource "aws_api_gateway_domain_name" "api" {
      ~ arn                      = "arn:aws:apigateway:ca-central-1::/domainnames/api-lambda.notification.canada.ca" -> (known after apply)
      ~ certificate_upload_date  = "2021-11-05T18:43:50Z" -> (known after apply)
      + cloudfront_domain_name   = (known after apply)
      ~ cloudfront_zone_id       = "Z2FDTNDATAQYW2" -> (known after apply)
      ~ domain_name              = "api-lambda.notification.canada.ca" -> "api.notification.canada.ca" # forces replacement
      ~ id                       = "api-lambda.notification.canada.ca" -> (known after apply)
      ~ regional_domain_name     = "d-3hv37fqgbg.execute-api.ca-central-1.amazonaws.com" -> (known after apply)
      ~ regional_zone_id         = "Z19DQILCV0OWEC" -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_domain_name.api_lambda will be created
  + resource "aws_api_gateway_domain_name" "api_lambda" {
      + arn                      = (known after apply)
      + certificate_upload_date  = (known after apply)
      + cloudfront_domain_name   = (known after apply)
      + cloudfront_zone_id       = (known after apply)
      + domain_name              = "api-lambda.notification.canada.ca"
      + id                       = (known after apply)
      + regional_certificate_arn = "arn:aws:acm:ca-central-1:296255494825:certificate/562e7b2c-c913-4fbd-bfd5-d2f58d3c09dc"
      + regional_domain_name     = (known after apply)
      + regional_zone_id         = (known after apply)
      + security_policy          = "TLS_1_2"
      + tags_all                 = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # aws_api_gateway_method_settings.all will be created
  + resource "aws_api_gateway_method_settings" "all" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "71oj6jax35"
      + stage_name  = "v1"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "ERROR"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_appautoscaling_scheduled_action.api-5pm must be replaced
-/+ resource "aws_appautoscaling_scheduled_action" "api-5pm" {
      ~ arn                = "arn:aws:autoscaling:ca-central-1:296255494825:scheduledAction:522fb416-530f-49c4-85b0-242d36370903:resource/lambda/function:api-lambda:2:scheduledActionName/api-5pm" -> (known after apply)
      ~ id                 = "api-5pm-lambda-function:api-lambda:2" -> (known after apply)
        name               = "api-5pm"
      ~ resource_id        = "function:api-lambda:2" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_scheduled_action.api-noon must be replaced
-/+ resource "aws_appautoscaling_scheduled_action" "api-noon" {
      ~ arn                = "arn:aws:autoscaling:ca-central-1:296255494825:scheduledAction:522fb416-530f-49c4-85b0-242d36370903:resource/lambda/function:api-lambda:2:scheduledActionName/api-noon" -> (known after apply)
      ~ id                 = "api-noon-lambda-function:api-lambda:2" -> (known after apply)
        name               = "api-noon"
      ~ resource_id        = "function:api-lambda:2" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.api must be replaced
-/+ resource "aws_appautoscaling_target" "api" {
      ~ id                 = "function:api-lambda:2" -> (known after apply)
      ~ max_capacity       = 5 -> 10
      ~ min_capacity       = 1 -> 3
      ~ resource_id        = "function:api-lambda:2" -> (known after apply) # forces replacement
      ~ role_arn           = "arn:aws:iam::296255494825:role/aws-service-role/lambda.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_LambdaConcurrency" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.notification-canada-ca-api-lambda-waf-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-api-lambda-waf-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "aws-waf-logs-notification-canada-ca-api-lambda-waf"
      + retention_in_days = 7
      + tags              = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all          = {
          + "CostCenter" = "notification-canada-ca-production"
        }
    }

  # aws_cloudwatch_log_metric_filter.errors-lambda-api will be created
  + resource "aws_cloudwatch_log_metric_filter" "errors-lambda-api" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/api-lambda"
      + name           = "errors-lambda-api"
      + pattern        = "\"\\\"levelname\\\": \\\"ERROR\\\"\""

      + metric_transformation {
          + name      = "errors-lambda-api"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.web-500-errors-lambda-api will be destroyed
  - resource "aws_cloudwatch_log_metric_filter" "web-500-errors-lambda-api" {
      - id             = "web-500-errors-lambda-api" -> null
      - log_group_name = "/aws/lambda/api-lambda" -> null
      - name           = "web-500-errors-lambda-api" -> null
      - pattern        = "\"\\\" 500 \"" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "500-errors-lambda-api" -> null
          - namespace  = "LogMetrics" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-lambda-api will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "logs-1-500-error-1-minute-warning-lambda-api" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> null
      - alarm_description         = "One 500 error in 1 minute for lambda api" -> null
      - alarm_name                = "logs-1-500-error-1-minute-warning-lambda-api" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:logs-1-500-error-1-minute-warning-lambda-api" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "logs-1-500-error-1-minute-warning-lambda-api" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "500-errors-lambda-api" -> null
      - namespace                 = "LogMetrics" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-error-1-minute-warning-lambda-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "One error in 1 minute for lambda api"
      + alarm_name                            = "logs-1-error-1-minute-warning-lambda-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "errors-lambda-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-lambda-api will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "logs-10-500-error-5-minutes-critical-lambda-api" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> null
      - alarm_description         = "Ten 500 errors in 5 minutes for lambda api" -> null
      - alarm_name                = "logs-10-500-error-5-minutes-critical-lambda-api" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:logs-10-500-error-5-minutes-critical-lambda-api" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "logs-10-500-error-5-minutes-critical-lambda-api" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "500-errors-lambda-api" -> null
      - namespace                 = "LogMetrics" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> null
      - period                    = 300 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 10 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-error-5-minutes-critical-lambda-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "Ten errors in 5 minutes for lambda api"
      + alarm_name                            = "logs-10-error-5-minutes-critical-lambda-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "errors-lambda-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.api-lambda-errors will be created
  + resource "aws_cloudwatch_query_definition" "api-lambda-errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/api-lambda",
        ]
      + name                = "API lambda - errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter levelname like /ERROR/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id        = "arn:aws:iam::296255494825:policy/notify-api"
        name      = "notify-api"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "ecr:GetDownloadUrlForlayer",
                            "ecr:BatchGetImage",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda"
                        Sid      = ""
                    },
                  ~ {
                      ~ Action   = [
                          - "sqs:*",
                          - "sns:Publish",
                          - "ses:SendRawEmail",
                          - "ses:SendEmail",
                          - "securityhub:BatchImportFindings",
                          - "s3:*",
                          - "mobiletargeting:*",
                        ] -> "s3:*"
                      ~ Resource = "*" -> "/*"
                        # (2 unchanged elements hidden)
                    },
                  + {
                      + Action   = [
                          + "sqs:*",
                          + "sns:Publish",
                          + "securityhub:BatchImportFindings",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.ecr will be updated in-place
  ~ resource "aws_iam_policy" "ecr" {
        id          = "arn:aws:iam::296255494825:policy/ecr-api-lambda-access"
        name        = "ecr-api-lambda-access"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:UploadLayerPart",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda"
                      - Sid      = "AllowPushPull"
                    },
                  - {
                      - Action   = "lambda:UpdateFunctionCode"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda"
                      - Sid      = "PermissionsToUpdateFunction"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api-lambda"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:3" -> (known after apply)
      ~ reserved_concurrent_executions = -1 -> 850
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "CSV_UPLOAD_BUCKET_NAME"                = "notification-canada-ca-production-csv-upload" -> ""
              # Warning: this attribute value will be marked as sensitive and will
              # not display in UI output after applying this change
              ~ "NEW_RELIC_LICENSE_KEY"                 = (sensitive)
                # (23 unchanged elements hidden)
            }
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_provisioned_concurrency_config.api must be replaced
-/+ resource "aws_lambda_provisioned_concurrency_config" "api" {
      ~ id                                = "api-lambda:2" -> (known after apply)
      ~ provisioned_concurrent_executions = 3 -> 1
      ~ qualifier                         = "2" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_wafv2_web_acl.api_lambda will be created
  + resource "aws_wafv2_web_acl" "api_lambda" {
      + arn        = (known after apply)
      + capacity   = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "api-lambda-waf"
      + scope      = "REGIONAL"
      + tags       = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all   = {
          + "CostCenter" = "notification-canada-ca-production"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAnonymousIpList"
          + priority = 5

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAnonymousIpList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAnonymousIpList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesBotControlRuleSet"
          + priority = 6

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesBotControlRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesBotControlRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 2

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 3

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 4

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "wafv2"
          + sampled_requests_enabled   = false
        }
    }

  # aws_wafv2_web_acl_association.waf_association will be created
  + resource "aws_wafv2_web_acl_association" "waf_association" {
      + id           = (known after apply)
      + resource_arn = "arn:aws:apigateway:ca-central-1::/restapis/71oj6jax35/stages/v1"
      + web_acl_arn  = (known after apply)
    }

  # aws_wafv2_web_acl_logging_configuration.notification-canada-ca-api-lambda-waf-logs will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "notification-canada-ca-api-lambda-waf-logs" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = (known after apply)
    }

Plan: 17 to add, 3 to change, 9 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>